tylertms/cortex-m4-sim/src/kinetis_k22_peripherals.c
#include "kinetis_k22_internal.h"

#include <string.h>

enum {
    K22_SIM_SCGC1 = 0x40048028u,
    K22_SIM_SCGC2 = 0x4004802cu,
    K22_AIPS0 = 0x40000000u,
    K22_AIPS1 = 0x40080000u,
    K22_AXBS = 0x40004000u,
    K22_FMC = 0x4001f000u,
    K22_USBDCD = 0x40035000u,
    K22_CMT = 0x40062000u,
};

static uint32_t width_mask(uint8_t size) {
    return size == 1 ? 0xffu : size == 2 ? 0xffffu : UINT32_MAX;
}

static bool pop_serial_event(K22Serial* serial, K22SerialEndpoint endpoint,
                             K22SerialEvent* event) {
    for (uint8_t offset = 0; offset < serial->event_count; offset++) {
        const uint8_t index =
            (uint8_t)((serial->event_read_index + offset) % K22_SERIAL_EVENT_CAPACITY);
        if (serial->events[index].endpoint != endpoint) {
            continue;
        }
        *event = serial->events[index];
        for (uint8_t current = offset; current + 1u < serial->event_count; current++) {
            const uint8_t destination =
                (uint8_t)((serial->event_read_index + current) % K22_SERIAL_EVENT_CAPACITY);
            const uint8_t source = (uint8_t)((serial->event_read_index + current + 1u) %
                                             K22_SERIAL_EVENT_CAPACITY);
            serial->events[destination] = serial->events[source];
        }
        serial->event_write_index =
            (uint8_t)((serial->event_write_index + K22_SERIAL_EVENT_CAPACITY - 1u) %
                      K22_SERIAL_EVENT_CAPACITY);
        serial->event_count--;
        return true;
    }
    return false;
}

static uint32_t raw_load(const KinetisK22* device, uint32_t address, uint8_t size) {
    if (address < K22_PERIPHERAL_BASE ||
        address - K22_PERIPHERAL_BASE > (uint32_t)K22_PERIPHERAL_SIZE - size) {
        return 0;
    }
    const uint8_t* bytes = device->peripheral + address - K22_PERIPHERAL_BASE;
    uint32_t value = 0;
    for (uint8_t index = 0; index < size; index++) {
        value |= (uint32_t)bytes[index] << (index * 8u);
    }
    return value;
}

static void raw_store(KinetisK22* device, uint32_t address, uint8_t size, uint32_t value) {
    if (address < K22_PERIPHERAL_BASE ||
        address - K22_PERIPHERAL_BASE > (uint32_t)K22_PERIPHERAL_SIZE - size) {
        return;
    }
    uint8_t* bytes = device->peripheral + address - K22_PERIPHERAL_BASE;
    for (uint8_t index = 0; index < size; index++) {
        bytes[index] = (uint8_t)(value >> (index * 8u));
    }
}

static bool aips_access_allowed(const KinetisK22* device, uint32_t address,
                                CortexM4Access access, bool write) {
    if (device->profile->id < K22_PROFILE_MK22FN1M012 || access == CORTEX_M4_ACCESS_DEBUG ||
        address < K22_PERIPHERAL_BASE ||
        address >= K22_PERIPHERAL_BASE + K22_PERIPHERAL_SIZE) {
        return true;
    }
    const uint32_t aperture = address < K22_AIPS1 ? K22_AIPS0 : K22_AIPS1;
    const uint8_t slot = (uint8_t)((address - aperture) >> 12u);
    const uint32_t control =
        raw_load(device, aperture + 0x20u + (uint32_t)(slot / 8u) * 4u, 4u);
    const uint8_t shift = (uint8_t)((7u - slot % 8u) * 4u);
    const uint8_t permission = (uint8_t)(control >> shift) & 7u;
    if (write && (permission & 2u) != 0u) {
        return false;
    }
    return !cortex_m4_access_is_unprivileged_data(device->cpu, access) ||
           (permission & 4u) == 0u;
}

static bool axbs_write_allowed(const KinetisK22* device, uint32_t address) {
    if (address < K22_AXBS || address >= K22_AXBS + 0x500u) {
        return true;
    }
    const uint32_t offset = address - K22_AXBS;
    const uint32_t register_offset = offset & 0xffu;
    if (register_offset != 0u && register_offset != 0x10u) {
        return true;
    }
    const uint32_t control = raw_load(device, address - register_offset + 0x10u, 4u);
    return (control & 0x80000000u) == 0u;
}

static bool cmt_read(KinetisK22* device, uint32_t address, uint8_t size, uint32_t* value) {
    if (address < K22_CMT || address >= K22_CMT + 0x0cu || size != 1u) {
        return false;
    }
    *value = raw_load(device, address, 1u);
    if (address == K22_CMT + 5u && (*value & 0x80u) != 0u) {
        device->cmt_eoc_read = true;
    }
    return true;
}

static void cmt_raise_cycle(KinetisK22* device, uint8_t control) {
    raw_store(device, K22_CMT + 5u, 1u, control | 0x80u);
    if ((control & 2u) != 0u && device->cpu != NULL) {
        cortex_m4_set_irq_level(device->cpu, 45u, true);
    }
    if ((raw_load(device, K22_CMT + 0x0bu, 1u) & 1u) != 0u) {
        k22_data_dma_request(device->data, 47u);
    }
}

static bool cmt_write(KinetisK22* device, uint32_t address, uint8_t size, uint32_t value) {
    if (address < K22_CMT || address >= K22_CMT + 0x0cu || size != 1u) {
        return false;
    }
    const uint32_t offset = address - K22_CMT;
    if (offset == 5u) {
        const uint8_t previous = (uint8_t)raw_load(device, address, 1u);
        const uint8_t control = (uint8_t)(value & 0x7fu);
        raw_store(device, address, 1u, (previous & 0x80u) | control);
        if ((value & 1u) == 0u) {
            device->cmt_cycles = 0u;
        } else if ((previous & 1u) == 0u) {
            device->cmt_cycles = 0u;
            cmt_raise_cycle(device, control);
        }
        return true;
    }
    const K22RegisterDescriptor* descriptor =
        k22_register_manifest_lookup(device->profile->id, address, 8u);
    if (descriptor == NULL || (descriptor->access & K22_REGISTER_ACCESS_WRITE) == 0u) {
        return false;
    }
    raw_store(device, address, 1u, value & descriptor->write_mask);
    if ((offset == 7u || offset == 9u) && device->cmt_eoc_read) {
        raw_store(device, K22_CMT + 5u, 1u, raw_load(device, K22_CMT + 5u, 1u) & 0x7fu);
        device->cmt_eoc_read = false;
        if (device->cpu != NULL) {
            cortex_m4_set_irq_level(device->cpu, 45u, false);
        }
    }
    return true;
}

static uint64_t cmt_period(const KinetisK22* device) {
    const uint32_t mark =
        (raw_load(device, K22_CMT + 6u, 1u) << 8u) | raw_load(device, K22_CMT + 7u, 1u);
    const uint32_t space =
        (raw_load(device, K22_CMT + 8u, 1u) << 8u) | raw_load(device, K22_CMT + 9u, 1u);
    const uint32_t primary = raw_load(device, K22_CMT + 0x0au, 1u) + 1u;
    const uint32_t secondary = 1u << ((raw_load(device, K22_CMT + 5u, 1u) >> 5u) & 3u);
    return (uint64_t)(mark + space + 1u) * 8u * primary * secondary;
}

static void cmt_advance(KinetisK22* device, uint32_t cycles) {
    const uint8_t control = (uint8_t)raw_load(device, K22_CMT + 5u, 1u);
    if ((control & 1u) == 0u) {
        return;
    }
    device->cmt_cycles += cycles;
    const uint64_t period = cmt_period(device);
    if (device->cmt_cycles < period) {
        return;
    }
    device->cmt_cycles %= period;
    cmt_raise_cycle(device, control);
}

static bool usbdcd_read(KinetisK22* device, uint32_t address, uint8_t size,
                        uint32_t* value) {
    if (address < K22_USBDCD || address >= K22_USBDCD + 0x1cu || size != 4u ||
        (address & 3u) != 0u) {
        return false;
    }
    *value = raw_load(device, address, 4u);
    return true;
}

static void usbdcd_reset(KinetisK22* device) {
    static const uint8_t offsets[] = {0u, 4u, 8u, 0x10u, 0x14u, 0x18u};
    for (size_t index = 0u; index < sizeof(offsets); index++) {
        const uint32_t address = K22_USBDCD + offsets[index];
        const K22RegisterDescriptor* descriptor =
            k22_register_manifest_lookup(device->profile->id, address, 32u);
        if (descriptor != NULL) {
            raw_store(device, address, 4u,
                      descriptor->reset_value & descriptor->implemented_mask);
        }
    }
    device->usbdcd_cycles = 0u;
    if (device->cpu != NULL) {
        cortex_m4_set_irq_level(device->cpu, 54u, false);
    }
}

static bool usbdcd_write(KinetisK22* device, uint32_t address, uint8_t size,
                         uint32_t value) {
    if (address != K22_USBDCD || size != 4u) {
        return false;
    }
    if ((value & (1u << 25u)) != 0u) {
        usbdcd_reset(device);
        return true;
    }
    uint32_t control = raw_load(device, K22_USBDCD, 4u);
    if ((value & 1u) != 0u) {
        control &= ~(1u << 8u);
        if (device->cpu != NULL) {
            cortex_m4_set_irq_level(device->cpu, 54u, false);
        }
    }
    control = (control & (1u << 8u)) | (value & 0x00030000u);
    if ((value & (1u << 24u)) != 0u &&
        (raw_load(device, K22_USBDCD + 8u, 4u) & (1u << 22u)) == 0u) {
        raw_store(device, K22_USBDCD + 8u, 4u, 1u << 22u);
        device->usbdcd_cycles = 0u;
    }
    raw_store(device, K22_USBDCD, 4u, control);
    return true;
}

