tylertms/cortex-m4-sim/src/kinetis_k22_peripherals.c
static uint64_t usbdcd_period(const KinetisK22* device) {
    const uint32_t timer0 = raw_load(device, K22_USBDCD + 0x10u, 4u);
    const uint32_t timer1 = raw_load(device, K22_USBDCD + 0x14u, 4u);
    const uint32_t timer2 = raw_load(device, K22_USBDCD + 0x18u, 4u);
    uint64_t ticks = (timer0 & 0xfffu) + ((timer0 >> 16u) & 0x3ffu) + 1u;
    if (device->usb_charger != KINETIS_K22_USB_CHARGER_STANDARD_HOST) {
        ticks += (timer1 & 0x3ffu) + ((timer1 >> 16u) & 0x3ffu) + (timer2 & 0x3ffu) +
                 ((timer2 >> 16u) & 0x3ffu) + 1u;
    }
    const uint32_t clock = raw_load(device, K22_USBDCD + 4u, 4u);
    const uint32_t speed = (clock >> 2u) & 0x3ffu;
    const uint64_t hz =
        (uint64_t)(speed == 0u ? 1u : speed) * ((clock & 1u) != 0u ? 1000000u : 1000u);
    const uint64_t core_hz = k22_timing_core_clock_hz(&device->timing);
    const uint64_t cycles_per_tick = core_hz > hz ? core_hz / hz : 1u;
    return ticks * cycles_per_tick;
}

static void usbdcd_advance(KinetisK22* device, uint32_t cycles) {
    if ((raw_load(device, K22_USBDCD + 8u, 4u) & (1u << 22u)) == 0u) {
        return;
    }
    device->usbdcd_cycles += cycles;
    if (device->usbdcd_cycles < usbdcd_period(device)) {
        return;
    }
    uint32_t status = 0u;
    if (device->usb_charger == KINETIS_K22_USB_CHARGER_NONE) {
        status = (1u << 20u) | (1u << 21u);
    } else {
        status = ((uint32_t)device->usb_charger << 16u) | (3u << 18u);
    }
    raw_store(device, K22_USBDCD + 8u, 4u, status);
    uint32_t control = raw_load(device, K22_USBDCD, 4u) | (1u << 8u);
    raw_store(device, K22_USBDCD, 4u, control);
    if ((control & (1u << 16u)) != 0u && device->cpu != NULL) {
        cortex_m4_set_irq_level(device->cpu, 54u, true);
    }
}

static bool serial_peripheral(K22PeripheralId id) {
    return id == K22_PERIPHERAL_LPUART0 || id == K22_PERIPHERAL_SPI0 ||
           id == K22_PERIPHERAL_SPI1 || id == K22_PERIPHERAL_SPI2 ||
           id == K22_PERIPHERAL_I2C0 || id == K22_PERIPHERAL_I2C1 ||
           id == K22_PERIPHERAL_I2C2 || id == K22_PERIPHERAL_UART0 ||
           id == K22_PERIPHERAL_UART1 || id == K22_PERIPHERAL_UART2 ||
           id == K22_PERIPHERAL_UART3 || id == K22_PERIPHERAL_UART4 ||
           id == K22_PERIPHERAL_UART5;
}

static bool package_serial_extension(K22PeripheralId id) {
    return id == K22_PERIPHERAL_SPI1 || id == K22_PERIPHERAL_SPI2 ||
           id == K22_PERIPHERAL_UART3 || id == K22_PERIPHERAL_UART4 ||
           id == K22_PERIPHERAL_UART5;
}

static bool manifest_extension(K22PeripheralId id) {
    return package_serial_extension(id) || id == K22_PERIPHERAL_SDHC ||
           id == K22_PERIPHERAL_DAC1;
}

static K22PeripheralId serial_endpoint_peripheral(KinetisK22SerialEndpoint endpoint) {
    static const K22PeripheralId peripherals[KINETIS_K22_SERIAL_ENDPOINT_COUNT] = {
        K22_PERIPHERAL_LPUART0, K22_PERIPHERAL_SPI0,  K22_PERIPHERAL_SPI1,
        K22_PERIPHERAL_SPI2,    K22_PERIPHERAL_I2C0,  K22_PERIPHERAL_I2C1,
        K22_PERIPHERAL_I2C2,    K22_PERIPHERAL_UART0, K22_PERIPHERAL_UART1,
        K22_PERIPHERAL_UART2,   K22_PERIPHERAL_UART3, K22_PERIPHERAL_UART4,
        K22_PERIPHERAL_UART5,
    };
    return endpoint < KINETIS_K22_SERIAL_ENDPOINT_COUNT ? peripherals[endpoint]
                                                        : K22_PERIPHERAL_COUNT;
}

static bool serial_endpoint_available(const KinetisK22* device,
                                      KinetisK22SerialEndpoint endpoint) {
    const K22PeripheralId peripheral = serial_endpoint_peripheral(endpoint);
    return device != NULL && peripheral < K22_PERIPHERAL_COUNT &&
           k22_package_has_peripheral(device->package, peripheral);
}

static bool data_peripheral(K22PeripheralId id) {
    return id == K22_PERIPHERAL_FLASH_CONFIG || id == K22_PERIPHERAL_DMA ||
           id == K22_PERIPHERAL_FTFA || id == K22_PERIPHERAL_FTFE ||
           id == K22_PERIPHERAL_DMAMUX || id == K22_PERIPHERAL_ADC0 ||
           id == K22_PERIPHERAL_ADC1 || id == K22_PERIPHERAL_DAC0 ||
           id == K22_PERIPHERAL_DAC1 || id == K22_PERIPHERAL_RNG ||
           id == K22_PERIPHERAL_CRC || id == K22_PERIPHERAL_CMP0 ||
           id == K22_PERIPHERAL_CMP1 || id == K22_PERIPHERAL_CMP2 ||
           id == K22_PERIPHERAL_VREF;
}

static bool timing_peripheral(K22PeripheralId id) {
    return id == K22_PERIPHERAL_FTM0 || id == K22_PERIPHERAL_FTM1 ||
           id == K22_PERIPHERAL_FTM2 || id == K22_PERIPHERAL_FTM3 ||
           id == K22_PERIPHERAL_PDB0 || id == K22_PERIPHERAL_PIT ||
           id == K22_PERIPHERAL_RTC || id == K22_PERIPHERAL_LPTMR0 ||
           id == K22_PERIPHERAL_SIM || id == K22_PERIPHERAL_WDOG ||
           id == K22_PERIPHERAL_EWM || id == K22_PERIPHERAL_MCG ||
           id == K22_PERIPHERAL_OSC || id == K22_PERIPHERAL_LLWU ||
           id == K22_PERIPHERAL_PMC || id == K22_PERIPHERAL_SMC || id == K22_PERIPHERAL_RCM;
}

static bool io_peripheral(K22PeripheralId id) {
    return id == K22_PERIPHERAL_FB || id == K22_PERIPHERAL_SYSMPU ||
           id == K22_PERIPHERAL_CAN0 || id == K22_PERIPHERAL_I2S0 ||
           id == K22_PERIPHERAL_USB0 || id == K22_PERIPHERAL_PORTA ||
           id == K22_PERIPHERAL_PORTB || id == K22_PERIPHERAL_PORTC ||
           id == K22_PERIPHERAL_PORTD || id == K22_PERIPHERAL_PORTE ||
           id == K22_PERIPHERAL_GPIOA || id == K22_PERIPHERAL_GPIOB ||
           id == K22_PERIPHERAL_GPIOC || id == K22_PERIPHERAL_GPIOD ||
           id == K22_PERIPHERAL_GPIOE || id == K22_PERIPHERAL_MCM;
}

static uint8_t data_irq(K22DataInterrupt interrupt) {
    static const uint8_t irqs[K22_DATA_INTERRUPT_COUNT] = {
        0,  1,  2,  3,  4,  5,  6,  7,  8,  9,  10, 11, 12,
        13, 14, 15, 16, 18, 39, 73, 56, 72, 40, 41, 70, 23,
    };
    return irqs[interrupt];
}

static void adc_alternate_trigger(KinetisK22* device, uint8_t source) {
    for (uint8_t instance = 0u; instance < 2u; instance++) {
        const uint8_t selection = (uint8_t)(device->timing.sim_sopt7 >> (instance * 8u));
        if ((selection & 0x80u) != 0u && (selection & 15u) == source)
            k22_data_adc_pretrigger(device->data, instance,
                                    (uint8_t)((selection >> 4u) & 1u));
    }
}

static void data_interrupt(void* context, K22DataInterrupt interrupt, bool asserted) {
    KinetisK22* device = context;
    if (interrupt >= K22_DATA_INTERRUPT_CMP0 && interrupt <= K22_DATA_INTERRUPT_CMP2 &&
        device->data != NULL) {
        const uint8_t instance = (uint8_t)(interrupt - K22_DATA_INTERRUPT_CMP0);
        bool high = false;
        if (k22_data_get_cmp_output(device->data, instance, &high)) {
            if (instance == 0u)
                k22_timing_set_lptmr_input(&device->timing, 0u, high);
            if (high && !device->comparator_output[instance])
                adc_alternate_trigger(device, (uint8_t)(1u + instance));
            device->comparator_output[instance] = high;
        }
    }
    if (device->cpu != NULL && interrupt < K22_DATA_INTERRUPT_COUNT) {
        cortex_m4_set_irq_level(device->cpu, data_irq(interrupt), asserted);
    }
}

static bool data_bus_read(void* context, uint32_t address, uint8_t size, uint32_t* value) {
    return kinetis_k22_dma_read(context, address, size, value);
}

static bool data_bus_write(void* context, uint32_t address, uint8_t size, uint32_t value) {
    return kinetis_k22_dma_write(context, address, size, value);
}

static bool flash_bus_write(void* context, uint32_t address, uint8_t size, uint32_t value) {
    return kinetis_k22_flash_controller_write(context, address, size, value);
}

static void timing_irq(void* context, uint8_t irq, bool asserted) {
    KinetisK22* device = context;
    if (device->cpu != NULL) {
        cortex_m4_set_irq_level(device->cpu, irq, asserted);
    }
}

static void timing_dma(void* context, uint8_t source) {
    KinetisK22* device = context;
    k22_data_dma_request(device->data, source);
}

static void timing_reset(void* context, uint8_t cause_0, uint8_t cause_1) {
    kinetis_k22_warm_reset(context, cause_0, cause_1);
}

static void timing_trigger(void* context, K22TimingTrigger type, uint8_t instance,
                           uint8_t channel) {
    KinetisK22* device = context;
    if (type == K22_TIMING_TRIGGER_PDB_ADC) {
        const uint8_t selection = (uint8_t)(device->timing.sim_sopt7 >> (instance * 8u));
        if ((selection & 0x80u) == 0u)
            k22_data_adc_pretrigger(device->data, instance, channel);
    } else if (type == K22_TIMING_TRIGGER_PDB_DAC) {
        k22_data_dac_trigger(device->data, instance);
    } else {
        adc_alternate_trigger(device, instance);
    }
}

static void queue_event(KinetisK22* device, const K22IoEvent* source) {
    if (device->event_count == K22_EVENT_CAPACITY) {
        device->event_read_index =
            (uint8_t)((device->event_read_index + 1u) % K22_EVENT_CAPACITY);
        device->event_count--;
    }
    KinetisK22Event* event = &device->events[device->event_write_index];
    event->type = (KinetisK22EventType)source->type;
    event->source = source->source;
    event->value = source->value;
    event->auxiliary = source->auxiliary;
    memcpy(event->data, source->data, sizeof(event->data));
    event->length = source->length;
    event->extended = source->extended;
    event->remote = source->remote;
    device->event_write_index =
        (uint8_t)((device->event_write_index + 1u) % K22_EVENT_CAPACITY);
    device->event_count++;
}

static void io_event(void* context, const K22IoEvent* event) {
    KinetisK22* device = context;
    queue_event(device, event);
    if (event->type == K22_IO_EVENT_DMA) {
        uint8_t source = event->auxiliary == 0 ? (event->source == 0 ? 13u : 12u)
                                               : (uint8_t)(49u + event->source / 32u);
        k22_data_dma_request(device->data, source);
    }
}

static bool gate(uint32_t value, uint8_t bit) { return (value & (1u << bit)) != 0; }

static bool peripheral_clock_enabled(const KinetisK22* device, K22PeripheralId id) {
    const uint32_t scgc1 = raw_load(device, K22_SIM_SCGC1, 4);
    const uint32_t scgc3 = device->timing.sim_scgc3;
    const uint32_t scgc4 = device->timing.sim_scgc4;
    const uint32_t scgc5 = device->timing.sim_scgc5;
    const uint32_t scgc6 = device->timing.sim_scgc6;
    const uint32_t scgc7 = device->timing.sim_scgc7;
    if (id >= K22_PERIPHERAL_PORTA && id <= K22_PERIPHERAL_PORTE) {
        return gate(scgc5, (uint8_t)(9u + id - K22_PERIPHERAL_PORTA));
    }
    if (id >= K22_PERIPHERAL_GPIOA && id <= K22_PERIPHERAL_GPIOE) {
        return gate(scgc5, (uint8_t)(9u + id - K22_PERIPHERAL_GPIOA));
    }
    switch (id) {
    case K22_PERIPHERAL_DMA:
        return gate(scgc7, 1);
    case K22_PERIPHERAL_FB:
        return gate(scgc7, 0);
    case K22_PERIPHERAL_SYSMPU:
        return gate(scgc7, 2);
    case K22_PERIPHERAL_FTFA:
    case K22_PERIPHERAL_FTFE:
        return gate(scgc6, 0);
    case K22_PERIPHERAL_DMAMUX:
        return gate(scgc6, 1);
    case K22_PERIPHERAL_CAN0:
        return gate(scgc6, 4);
    case K22_PERIPHERAL_FTM0:
    case K22_PERIPHERAL_FTM1:
        return gate(scgc6, (uint8_t)(24u + id - K22_PERIPHERAL_FTM0));
    case K22_PERIPHERAL_FTM2:
        return device->profile->id >= K22_PROFILE_MK22FN1M012 ? gate(scgc3, 24)
                                                              : gate(scgc6, 26);
    case K22_PERIPHERAL_FTM3:
        return device->profile->id >= K22_PROFILE_MK22FN1M012 ? gate(scgc3, 25)
                                                              : gate(scgc6, 6);
    case K22_PERIPHERAL_ADC0:
        return gate(scgc6, 27);
    case K22_PERIPHERAL_ADC1:
        return device->profile->id >= K22_PROFILE_MK22FN1M012 ? gate(scgc3, 27)
                                                              : gate(scgc6, 7);
    case K22_PERIPHERAL_DAC0:
        return device->profile->id >= K22_PROFILE_MK22FN1M012
                   ? gate(raw_load(device, K22_SIM_SCGC2, 4), 12)
                   : gate(scgc6, 31);
    case K22_PERIPHERAL_DAC1:
        return device->profile->id >= K22_PROFILE_MK22FN1M012
                   ? gate(raw_load(device, K22_SIM_SCGC2, 4), 13)
                   : gate(scgc6, 8);
    case K22_PERIPHERAL_RNG:
        return gate(scgc6, 9);
    case K22_PERIPHERAL_LPUART0:
        return gate(scgc6, 10);
    case K22_PERIPHERAL_SPI0:
        return gate(scgc6, 12);
    case K22_PERIPHERAL_SPI1:
        return gate(scgc6, 13);
    case K22_PERIPHERAL_SPI2:
        return gate(scgc3, 12);
    case K22_PERIPHERAL_SDHC:
        return gate(scgc3, 17);
    case K22_PERIPHERAL_I2S0:
        return gate(scgc6, 15);
    case K22_PERIPHERAL_CRC:
        return gate(scgc6, 18);
    case K22_PERIPHERAL_USBDCD:
        return gate(scgc6, 21);
    case K22_PERIPHERAL_PDB0:
        return gate(scgc6, 22);
    case K22_PERIPHERAL_PIT:
        return gate(scgc6, 23);
    case K22_PERIPHERAL_RTC:
        return gate(scgc6, 29);
    case K22_PERIPHERAL_LPTMR0:
        return gate(scgc5, 0);
    case K22_PERIPHERAL_CMT:
        return gate(scgc4, 2);
    case K22_PERIPHERAL_I2C0:
        return gate(scgc4, 6);
    case K22_PERIPHERAL_I2C1:
        return gate(scgc4, 7);
    case K22_PERIPHERAL_I2C2:
        return gate(scgc1, 6);
    case K22_PERIPHERAL_UART0:
        return gate(scgc4, 10);
    case K22_PERIPHERAL_UART1:
        return gate(scgc4, 11);
    case K22_PERIPHERAL_UART2:
        return gate(scgc4, 12);
    case K22_PERIPHERAL_UART3:
        return gate(scgc4, 13);
    case K22_PERIPHERAL_UART4:
        return gate(scgc1, 10);
    case K22_PERIPHERAL_UART5:
        return gate(scgc1, 11);
    case K22_PERIPHERAL_USB0:
        return gate(scgc4, 18);
    case K22_PERIPHERAL_CMP0:
    case K22_PERIPHERAL_CMP1:
    case K22_PERIPHERAL_CMP2:
        return gate(scgc4, 19);
    case K22_PERIPHERAL_VREF:
        return gate(scgc4, 20);
    default:
        return true;
    }
}

