tylertms/cortex-m4-sim/src/kinetis_k22_peripherals.c
void kinetis_k22_sync_clock_gates(KinetisK22* device) {
    const uint32_t scgc1 = raw_load(device, K22_SIM_SCGC1, 4);
    const uint32_t scgc3 = device->timing.sim_scgc3;
    const uint32_t scgc4 = device->timing.sim_scgc4;
    const uint32_t scgc5 = device->timing.sim_scgc5;
    const uint32_t scgc6 = device->timing.sim_scgc6;
    const uint32_t scgc7 = device->timing.sim_scgc7;
    k22_serial_set_clocks(&device->serial, k22_timing_core_clock_hz(&device->timing),
                          k22_timing_bus_clock_hz(&device->timing));
    k22_serial_set_clock_gate(&device->serial, K22_PERIPHERAL_LPUART0, gate(scgc6, 10));
    k22_serial_set_clock_gate(&device->serial, K22_PERIPHERAL_SPI0, gate(scgc6, 12));
    k22_serial_set_clock_gate(&device->serial, K22_PERIPHERAL_SPI1, gate(scgc6, 13));
    k22_serial_set_clock_gate(&device->serial, K22_PERIPHERAL_SPI2, gate(scgc3, 12));
    k22_serial_set_clock_gate(&device->serial, K22_PERIPHERAL_I2C0, gate(scgc4, 6));
    k22_serial_set_clock_gate(&device->serial, K22_PERIPHERAL_I2C1, gate(scgc4, 7));
    k22_serial_set_clock_gate(&device->serial, K22_PERIPHERAL_I2C2, gate(scgc1, 6));
    k22_serial_set_clock_gate(&device->serial, K22_PERIPHERAL_UART0, gate(scgc4, 10));
    k22_serial_set_clock_gate(&device->serial, K22_PERIPHERAL_UART1, gate(scgc4, 11));
    k22_serial_set_clock_gate(&device->serial, K22_PERIPHERAL_UART2, gate(scgc4, 12));
    k22_serial_set_clock_gate(&device->serial, K22_PERIPHERAL_UART3, gate(scgc4, 13));
    k22_serial_set_clock_gate(&device->serial, K22_PERIPHERAL_UART4, gate(scgc1, 10));
    k22_serial_set_clock_gate(&device->serial, K22_PERIPHERAL_UART5, gate(scgc1, 11));
    k22_sdhc_set_clock(&device->sdhc, gate(scgc3, 17));
    for (uint8_t port = 0; port < 5; port++) {
        k22_io_set_clock(&device->io, (K22PeripheralId)(K22_PERIPHERAL_PORTA + port),
                         gate(scgc5, (uint8_t)(9u + port)));
    }
    k22_io_set_clock(&device->io, K22_PERIPHERAL_USB0, gate(scgc4, 18));
    k22_io_set_clock(&device->io, K22_PERIPHERAL_I2S0, gate(scgc6, 15));
    k22_io_set_clock(&device->io, K22_PERIPHERAL_FB, gate(scgc7, 0));
    k22_io_set_clock(&device->io, K22_PERIPHERAL_CAN0, gate(scgc6, 4));
    k22_io_set_clock(&device->io, K22_PERIPHERAL_SYSMPU, gate(scgc7, 2));
}

static void refresh_serial_signals(KinetisK22* device) {
    static const uint8_t irqs[K22_SERIAL_IRQ_COUNT] = {
        30, 26, 27, 65, 24, 25, 74, 31, 32, 33, 34, 35, 36, 37, 38, 66, 67, 68, 69,
    };
    static const uint8_t dma_sources[K22_SERIAL_DMA_COUNT] = {
        58, 59, 14, 15, 16, 16, 17, 17, 18, 19, 19, 2, 3, 4, 5, 6, 7, 8, 9, 10, 10, 11, 11,
    };
    if (device->cpu != NULL) {
        for (uint8_t index = 0; index < K22_SERIAL_IRQ_COUNT; index++) {
            cortex_m4_set_irq_level(device->cpu, irqs[index],
                                    k22_serial_irq(&device->serial, (K22SerialIrq)index));
        }
    }
    for (uint8_t index = 0; index < K22_SERIAL_DMA_COUNT; index++) {
        if (k22_serial_dma_request(&device->serial, (K22SerialDmaRequest)index)) {
            k22_data_dma_request(device->data, dma_sources[index]);
        }
    }
}

void kinetis_k22_refresh_signals(KinetisK22* device) {
    if (device != NULL) {
        refresh_serial_signals(device);
        if (device->cpu != NULL) {
            static const uint8_t irqs[] = {28u, 29u, 53u, 59u, 60u, 61u, 62u, 63u, 75u};
            for (size_t index = 0; index < sizeof(irqs); index++) {
                cortex_m4_set_irq_level(device->cpu, irqs[index],
                                        k22_io_irq_asserted(&device->io, irqs[index]));
            }
            cortex_m4_set_irq_level(device->cpu, 81u, k22_sdhc_irq(&device->sdhc));
        }
    }
}

static bool enable_debug_clock(KinetisK22* device, K22PeripheralId id) {
    if (serial_peripheral(id)) {
        return k22_serial_set_clock_gate(&device->serial, id, true);
    }
    if (id == K22_PERIPHERAL_SDHC) {
        k22_sdhc_set_clock(&device->sdhc, true);
        return true;
    }
    if (io_peripheral(id)) {
        k22_io_set_clock(&device->io, id, true);
        return true;
    }
    return false;
}

static bool semantic_read(KinetisK22* device, K22PeripheralId id, uint32_t address,
                          uint8_t size, uint32_t* value) {
    if (id == K22_PERIPHERAL_CMT) {
        return cmt_read(device, address, size, value);
    }
    if (id == K22_PERIPHERAL_USBDCD) {
        return usbdcd_read(device, address, size, value);
    }
    if (timing_peripheral(id) && k22_timing_read(&device->timing, address, size, value)) {
        return true;
    }
    if (data_peripheral(id) && k22_data_read(device->data, address, size, value)) {
        return true;
    }
    if (serial_peripheral(id) && k22_serial_read(&device->serial, address, size, value)) {
        return true;
    }
    if (id == K22_PERIPHERAL_SDHC)
        return k22_sdhc_read(&device->sdhc, address, size, value);
    return io_peripheral(id) && k22_io_read(&device->io, address, size, value);
}

static bool semantic_write(KinetisK22* device, K22PeripheralId id, uint32_t address,
                           uint8_t size, uint32_t value) {
    if (id == K22_PERIPHERAL_CMT) {
        return cmt_write(device, address, size, value);
    }
    if (id == K22_PERIPHERAL_USBDCD) {
        return usbdcd_write(device, address, size, value);
    }
    if (timing_peripheral(id) && k22_timing_write(&device->timing, address, size, value)) {
        kinetis_k22_sync_clock_gates(device);
        return true;
    }
    if (data_peripheral(id) && k22_data_write(device->data, address, size, value)) {
        return true;
    }
    if (serial_peripheral(id) && k22_serial_write(&device->serial, address, size, value)) {
        return true;
    }
    if (id == K22_PERIPHERAL_SDHC)
        return k22_sdhc_write(&device->sdhc, address, size, value);
    return io_peripheral(id) && k22_io_write(&device->io, address, size, value);
}

static const K22RegisterDescriptor*
manifest_descriptor_for_access(const KinetisK22* device, uint32_t address, uint8_t size) {
    const K22RegisterDescriptor* exact =
        k22_register_manifest_lookup(device->profile->id, address, (uint8_t)(size * 8u));
    if (exact != NULL) {
        return exact;
    }
    const K22RegisterManifest* manifest = device->manifest;
    const uint32_t end = address + size;
    for (size_t index = 0u; index < manifest->register_count; index++) {
        const K22RegisterDescriptor* candidate = &manifest->registers[index];
        const uint32_t candidate_end = candidate->address + candidate->width / 8u;
        if (candidate->address <= address && candidate_end >= end)
            return candidate;
    }
    return NULL;
}

static uint32_t manifest_access_mask(const K22RegisterDescriptor* descriptor,
                                     uint32_t address, uint32_t mask) {
    return mask >> ((address - descriptor->address) * 8u);
}

static bool manifest_read(KinetisK22* device, uint32_t address, uint8_t size,
                          uint32_t* value) {
    const K22RegisterDescriptor* descriptor =
        manifest_descriptor_for_access(device, address, size);
    if (descriptor == NULL || (descriptor->access & K22_REGISTER_ACCESS_READ) == 0 ||
        address < K22_PERIPHERAL_BASE) {
        return false;
    }
    *value = raw_load(device, address, size) &
             manifest_access_mask(descriptor, address, descriptor->read_mask) &
             manifest_access_mask(descriptor, address, descriptor->implemented_mask) &
             width_mask(size);
    return true;
}

static bool manifest_write(KinetisK22* device, uint32_t address, uint8_t size,
                           uint32_t value) {
    const K22RegisterDescriptor* descriptor =
        manifest_descriptor_for_access(device, address, size);
    if (descriptor == NULL || address < K22_PERIPHERAL_BASE) {
        return false;
    }
    if ((descriptor->access & K22_REGISTER_ACCESS_WRITE) == 0) {
        return true;
    }
    const uint32_t mask =
        manifest_access_mask(descriptor, address, descriptor->implemented_mask) &
        width_mask(size);
    const uint32_t write_mask =
        manifest_access_mask(descriptor, address, descriptor->write_mask);
    const uint32_t w1c_mask =
        manifest_access_mask(descriptor, address, descriptor->w1c_mask);
    const uint32_t writable = write_mask & ~w1c_mask & mask;
    const uint32_t clear = w1c_mask & value & mask;
    uint32_t current = raw_load(device, address, size);
    current = (current & ~writable) | (value & writable);
    current &= ~clear;
    raw_store(device, address, size, current & mask);
    return true;
}

static void apply_fmc_control(KinetisK22* device, uint32_t address, uint8_t size,
                              uint32_t value) {
    if (address != K22_FMC + 4u || size != 4u) {
        return;
    }
    const uint8_t ways = (uint8_t)((value >> 20u) & 0x0fu);
    const uint8_t sets = device->profile->id >= K22_PROFILE_MK22FN1M012 ? 4u : 8u;
    for (uint8_t way = 0u; way < 4u; way++) {
        if ((ways & (1u << way)) == 0u) {
            continue;
        }
        for (uint8_t set = 0u; set < sets; set++) {
            const uint32_t tag_address =
                K22_FMC + 0x100u + ((uint32_t)way * sets + set) * 4u;
            if (k22_register_manifest_lookup(device->profile->id, tag_address, 32u) !=
                NULL) {
                raw_store(device, tag_address, 4u, raw_load(device, tag_address, 4u) & ~1u);
            }
        }
    }
    const uint32_t control = raw_load(device, address, 4u) & ~0x00f80000u;
    raw_store(device, address, 4u, control);
}

bool kinetis_k22_peripheral_read(KinetisK22* device, uint32_t address, uint8_t size,
                                 CortexM4Access access, uint32_t* value) {
    K22PeripheralLocation location;
    const K22RegisterDescriptor* descriptor;
    if (device == NULL || value == NULL ||
        !k22_profile_resolve_peripheral(device->profile, address, size, &location) ||
        !k22_package_has_peripheral(device->package, location.id)) {
        return false;
    }
    descriptor = manifest_descriptor_for_access(device, address, size);
    if (location.id != K22_PERIPHERAL_MCM && !manifest_extension(location.id) &&
        (descriptor == NULL || (descriptor->access & K22_REGISTER_ACCESS_READ) == 0u)) {
        return false;
    }
    if (!aips_access_allowed(device, address, access, false)) {
        return false;
    }
    if (access != CORTEX_M4_ACCESS_DEBUG &&
        !peripheral_clock_enabled(device, location.id)) {
        return false;
    }
    const bool debug_clock =
        access == CORTEX_M4_ACCESS_DEBUG && enable_debug_clock(device, location.id);
    bool handled = semantic_read(device, location.id, address, size, value);
    if (!handled) {
        handled = manifest_read(device, address, size, value);
    }
    if (debug_clock) {
        kinetis_k22_sync_clock_gates(device);
    }
    kinetis_k22_refresh_signals(device);
    return handled;
}

bool kinetis_k22_peripheral_write(KinetisK22* device, uint32_t address, uint8_t size,
                                  CortexM4Access access, uint32_t value) {
    K22PeripheralLocation location;
    const K22RegisterDescriptor* descriptor;
    if (device == NULL ||
        !k22_profile_resolve_peripheral(device->profile, address, size, &location) ||
        !k22_package_has_peripheral(device->package, location.id)) {
        return false;
    }
    descriptor = manifest_descriptor_for_access(device, address, size);
    if (location.id != K22_PERIPHERAL_MCM && !manifest_extension(location.id) &&
        descriptor == NULL) {
        return false;
    }
    if (descriptor != NULL && (descriptor->access & K22_REGISTER_ACCESS_WRITE) == 0u) {
        return true;
    }
    if (!aips_access_allowed(device, address, access, true) ||
        (location.id == K22_PERIPHERAL_AXBS && !axbs_write_allowed(device, address))) {
        return false;
    }
    if (access != CORTEX_M4_ACCESS_DEBUG &&
        !peripheral_clock_enabled(device, location.id)) {
        return false;
    }
    const bool debug_clock =
        access == CORTEX_M4_ACCESS_DEBUG && enable_debug_clock(device, location.id);
    bool handled = semantic_write(device, location.id, address, size, value);
    if (!handled) {
        handled = manifest_write(device, address, size, value);
    }
    if (handled && location.id == K22_PERIPHERAL_FMC) {
        apply_fmc_control(device, address, size, value);
    }
    if (handled && (address == K22_SIM_SCGC1 || address == K22_SIM_SCGC2)) {
        kinetis_k22_sync_clock_gates(device);
    }
    if (debug_clock) {
        kinetis_k22_sync_clock_gates(device);
    }
    kinetis_k22_refresh_signals(device);
    return handled;
}

static void reset_manifest(KinetisK22* device) {
    memset(device->peripheral, 0, K22_PERIPHERAL_SIZE);
    for (size_t index = 0; index < device->manifest->register_count; index++) {
        const K22RegisterDescriptor* descriptor = &device->manifest->registers[index];
        const uint8_t size = (uint8_t)(descriptor->width / 8u);
        if (descriptor->address >= K22_PERIPHERAL_BASE &&
            descriptor->address - K22_PERIPHERAL_BASE <=
                (uint32_t)K22_PERIPHERAL_SIZE - size) {
            raw_store(device, descriptor->address, size,
                      descriptor->reset_value & descriptor->implemented_mask);
        }
    }
}

