tylertms/cortex-m4-sim/src/kinetis_k22_peripherals.c
void kinetis_k22_peripheral_reset(KinetisK22* device) {
    uint32_t external[5];
    uint32_t driven[5];
    memcpy(external, device->io.gpio_external, sizeof(external));
    memcpy(driven, device->io.gpio_external_drive, sizeof(driven));
    reset_manifest(device);
    device->cmt_cycles = 0u;
    device->usbdcd_cycles = 0u;
    device->cmt_eoc_read = false;
    memset(device->comparator_output, 0, sizeof(device->comparator_output));
    k22_data_reset(device->data);
    k22_serial_reset(&device->serial);
    k22_sdhc_reset(&device->sdhc);
    k22_io_reset(&device->io);
    memcpy(device->io.gpio_external, external, sizeof(external));
    memcpy(device->io.gpio_external_drive, driven, sizeof(driven));
    for (uint8_t port = 0; port < 5; port++) {
        device->io.gpio_filtered[port] = k22_io_pin_input(&device->io, port);
        device->io.gpio_pending[port] = device->io.gpio_filtered[port];
    }
    device->event_read_index = 0;
    device->event_write_index = 0;
    device->event_count = 0;
}

void kinetis_k22_peripheral_advance(KinetisK22* device, uint32_t cycles) {
    k22_timing_set_debug_halted(&device->timing,
                                device->cpu != NULL && device->cpu->debug.halted);
    k22_timing_advance(&device->timing, cycles);
    k22_data_advance(device->data, cycles);
    k22_serial_advance(&device->serial, cycles);
    k22_io_advance(&device->io, cycles);
    if (k22_profile_has_peripheral(device->profile, K22_PERIPHERAL_CMT) &&
        peripheral_clock_enabled(device, K22_PERIPHERAL_CMT)) {
        cmt_advance(device, cycles);
    }
    if (k22_profile_has_peripheral(device->profile, K22_PERIPHERAL_USBDCD) &&
        peripheral_clock_enabled(device, K22_PERIPHERAL_USBDCD)) {
        usbdcd_advance(device, cycles);
    }
    kinetis_k22_refresh_signals(device);
}

bool kinetis_k22_next_event(KinetisK22* device, KinetisK22Event* event) {
    if (device == NULL || event == NULL || device->event_count == 0) {
        return false;
    }
    *event = device->events[device->event_read_index];
    device->event_read_index =
        (uint8_t)((device->event_read_index + 1u) % K22_EVENT_CAPACITY);
    device->event_count--;
    return true;
}

bool kinetis_k22_set_adc_channel(KinetisK22* device, uint8_t instance, uint8_t channel,
                                 uint16_t value) {
    return device != NULL && k22_data_set_adc_input(device->data, instance, channel, value);
}

void kinetis_k22_set_adc0_channel(KinetisK22* device, uint8_t channel, uint16_t value) {
    (void)kinetis_k22_set_adc_channel(device, 0, channel, value);
}

bool kinetis_k22_set_cmp_input(KinetisK22* device, uint8_t instance, uint8_t input,
                               uint8_t value) {
    return device != NULL && k22_data_set_cmp_input(device->data, instance, input, value);
}

bool kinetis_k22_set_lptmr_input(KinetisK22* device, uint8_t input, bool high) {
    return device != NULL && k22_timing_set_lptmr_input(&device->timing, input, high);
}

bool kinetis_k22_set_ftm_input(KinetisK22* device, uint8_t instance, uint8_t channel,
                               bool high) {
    return device != NULL &&
           k22_timing_set_ftm_input(&device->timing, instance, channel, high);
}

bool kinetis_k22_get_ftm_output(const KinetisK22* device, uint8_t instance, uint8_t channel,
                                bool* high) {
    return device != NULL &&
           k22_timing_get_ftm_output(&device->timing, instance, channel, high);
}

bool kinetis_k22_get_dac_output(const KinetisK22* device, uint8_t instance,
                                uint16_t* value) {
    return device != NULL && instance < 2u &&
           k22_package_has_peripheral(device->package,
                                      (K22PeripheralId)(K22_PERIPHERAL_DAC0 + instance)) &&
           k22_data_get_dac_output(device->data, instance, value);
}

bool kinetis_k22_set_usb_charger(KinetisK22* device, KinetisK22UsbCharger charger) {
    if (device == NULL || charger > KINETIS_K22_USB_CHARGER_DEDICATED ||
        !k22_profile_has_peripheral(device->profile, K22_PERIPHERAL_USBDCD)) {
        return false;
    }
    device->usb_charger = charger;
    return true;
}

void kinetis_k22_rng_seed(KinetisK22* device, uint32_t seed) {
    if (device != NULL) {
        k22_data_rng_seed(device->data, seed);
    }
}

void kinetis_k22_gpio_drive(KinetisK22* device, uint8_t port, uint8_t pin, bool high) {
    if (device != NULL) {
        (void)k22_io_drive_pin(&device->io, port, pin, high);
        kinetis_k22_refresh_signals(device);
    }
}

void kinetis_k22_gpio_release(KinetisK22* device, uint8_t port, uint8_t pin) {
    if (device != NULL) {
        (void)k22_io_release_pin(&device->io, port, pin);
        kinetis_k22_refresh_signals(device);
    }
}

bool kinetis_k22_serial_receive(KinetisK22* device, KinetisK22SerialEndpoint endpoint,
                                uint16_t value, uint8_t status) {
    if (!serial_endpoint_available(device, endpoint)) {
        return false;
    }
    const K22PeripheralId id = serial_endpoint_peripheral(endpoint);
    (void)k22_serial_set_clock_gate(&device->serial, id, true);
    const bool result = k22_serial_push_receive(&device->serial,
                                                (K22SerialEndpoint)endpoint, value, status);
    k22_serial_advance(&device->serial, UINT32_MAX);
    refresh_serial_signals(device);
    kinetis_k22_sync_clock_gates(device);
    return result;
}

bool kinetis_k22_serial_transmit(KinetisK22* device, KinetisK22SerialEndpoint endpoint,
                                 uint16_t* value) {
    return serial_endpoint_available(device, endpoint) &&
           k22_serial_pop_transmit(&device->serial, (K22SerialEndpoint)endpoint, value);
}

bool kinetis_k22_spi_transfer(KinetisK22* device, KinetisK22SerialEndpoint endpoint,
                              KinetisK22SpiTransfer* transfer) {
    if (!serial_endpoint_available(device, endpoint) || transfer == NULL ||
        endpoint < KINETIS_K22_SERIAL_SPI0 || endpoint > KINETIS_K22_SERIAL_SPI2) {
        return false;
    }
    K22SerialSpiTransfer internal;
    if (!k22_serial_pop_spi_transfer(&device->serial, (K22SerialEndpoint)endpoint,
                                     &internal)) {
        return false;
    }
    transfer->data = internal.data;
    transfer->chip_selects = internal.chip_selects;
    transfer->clock_and_transfer_attributes = internal.clock_and_transfer_attributes;
    transfer->continuous_chip_select = internal.continuous_chip_select;
    transfer->end_of_queue = internal.end_of_queue;
    return true;
}

bool kinetis_k22_i2c_transfer(KinetisK22* device, KinetisK22SerialEndpoint endpoint,
                              KinetisK22I2cTransfer* transfer) {
    if (!serial_endpoint_available(device, endpoint) || transfer == NULL ||
        endpoint < KINETIS_K22_SERIAL_I2C0 || endpoint > KINETIS_K22_SERIAL_I2C2) {
        return false;
    }
    K22SerialEvent event;
    if (!pop_serial_event(&device->serial, (K22SerialEndpoint)endpoint, &event)) {
        return false;
    }
    static const KinetisK22I2cTransferType types[] = {
        KINETIS_K22_I2C_START, KINETIS_K22_I2C_REPEATED_START, KINETIS_K22_I2C_STOP,
        KINETIS_K22_I2C_WRITE, KINETIS_K22_I2C_READ,
    };
    if ((unsigned)event.type >= sizeof(types) / sizeof(types[0])) {
        return false;
    }
    transfer->type = types[event.type];
    transfer->value = (uint8_t)event.value;
    return true;
}

bool kinetis_k22_i2c_acknowledge(KinetisK22* device, KinetisK22SerialEndpoint endpoint,
                                 bool acknowledge) {
    if (!serial_endpoint_available(device, endpoint) ||
        endpoint < KINETIS_K22_SERIAL_I2C0 || endpoint > KINETIS_K22_SERIAL_I2C2) {
        return false;
    }
    const bool result = k22_serial_i2c_set_acknowledge(
        &device->serial, (K22SerialEndpoint)endpoint, acknowledge);
    k22_serial_advance(&device->serial, UINT32_MAX);
    refresh_serial_signals(device);
    return result;
}

