tylertms/cortex-m4-sim/src/kinetis_k22_peripherals.c
bool kinetis_k22_i2c_lose_arbitration(KinetisK22* device,
                                      KinetisK22SerialEndpoint endpoint) {
    if (!serial_endpoint_available(device, endpoint) ||
        endpoint < KINETIS_K22_SERIAL_I2C0 || endpoint > KINETIS_K22_SERIAL_I2C2) {
        return false;
    }
    const bool result =
        k22_serial_i2c_lose_arbitration(&device->serial, (K22SerialEndpoint)endpoint);
    refresh_serial_signals(device);
    return result;
}

bool kinetis_k22_i2c_receive(KinetisK22* device, KinetisK22SerialEndpoint endpoint,
                             uint8_t value) {
    return endpoint >= KINETIS_K22_SERIAL_I2C0 && endpoint <= KINETIS_K22_SERIAL_I2C2 &&
           kinetis_k22_serial_receive(device, endpoint, value, 0);
}

bool kinetis_k22_usb_token(KinetisK22* device, uint8_t endpoint, uint8_t token,
                           bool transmit) {
    if (device == NULL)
        return false;
    const bool result = k22_io_usb_token(&device->io, endpoint, token, transmit);
    kinetis_k22_refresh_signals(device);
    return result;
}

bool kinetis_k22_can_receive(KinetisK22* device, const KinetisK22CanFrame* frame) {
    if (device == NULL || frame == NULL) {
        return false;
    }
    K22CanFrame internal;
    internal.identifier = frame->identifier;
    internal.length = frame->length;
    memcpy(internal.data, frame->data, sizeof(internal.data));
    internal.extended = frame->extended;
    internal.remote = frame->remote;
    const bool result = k22_io_can_receive(&device->io, &internal);
    kinetis_k22_refresh_signals(device);
    return result;
}

bool kinetis_k22_i2s_receive(KinetisK22* device, uint32_t sample) {
    if (device == NULL)
        return false;
    const bool result = k22_io_i2s_receive(&device->io, sample);
    kinetis_k22_refresh_signals(device);
    return result;
}

bool kinetis_k22_i2s_transmit(KinetisK22* device, uint32_t* sample) {
    if (device == NULL)
        return false;
    const bool result = k22_io_i2s_transmit(&device->io, sample);
    kinetis_k22_refresh_signals(device);
    return result;
}

bool kinetis_k22_sdhc_insert(KinetisK22* device, const void* data, size_t size,
                             bool write_protected) {
    if (device == NULL || !k22_package_has_peripheral(device->package, K22_PERIPHERAL_SDHC))
        return false;
    const bool result = k22_sdhc_insert(&device->sdhc, data, size, write_protected);
    kinetis_k22_refresh_signals(device);
    return result;
}

void kinetis_k22_sdhc_eject(KinetisK22* device) {
    if (device != NULL) {
        k22_sdhc_eject(&device->sdhc);
        kinetis_k22_refresh_signals(device);
    }
}

bool kinetis_k22_sdhc_read_card(const KinetisK22* device, size_t offset, void* data,
                                size_t size) {
    return device != NULL && k22_sdhc_read_card(&device->sdhc, offset, data, size);
}

bool kinetis_k22_uart1_receive(KinetisK22* device, uint8_t value, uint8_t status) {
    if (device == NULL) {
        return false;
    }
    K22SerialUart* uart = &device->serial.uart[1];
    if (!uart->present || uart->receive.count == K22_SERIAL_FIFO_CAPACITY) {
        return false;
    }
    uart->receive.values[uart->receive.write_index] = value;
    uart->receive.metadata[uart->receive.write_index] = status & 0x0fu;
    uart->receive.write_index =
        (uint16_t)((uart->receive.write_index + 1u) % K22_SERIAL_FIFO_CAPACITY);
    uart->receive.count++;
    (void)k22_serial_set_clock_gate(&device->serial, K22_PERIPHERAL_UART1, true);
    (void)k22_serial_read(&device->serial, uart->base + 4u, 1, &(uint32_t){0});
    refresh_serial_signals(device);
    kinetis_k22_sync_clock_gates(device);
    return true;
}

bool kinetis_k22_uart1_transmit(KinetisK22* device, uint8_t* value) {
    uint16_t wide = 0;
    if (device == NULL || value == NULL) {
        return false;
    }
    K22SerialFifo* fifo = &device->serial.uart[1].transmit;
    if (fifo->count == 0) {
        if (!kinetis_k22_serial_transmit(device, KINETIS_K22_SERIAL_UART1, &wide)) {
            return false;
        }
    } else {
        wide = fifo->values[fifo->read_index];
        fifo->read_index = (uint16_t)((fifo->read_index + 1u) % K22_SERIAL_FIFO_CAPACITY);
        fifo->count--;
    }
    *value = (uint8_t)wide;
    return true;
}

bool kinetis_k22_spi0_receive(KinetisK22* device, uint16_t value) {
    if (device == NULL) {
        return false;
    }
    K22SerialSpi* spi = &device->serial.spi[0];
    if (!spi->present || spi->receive.count == K22_SERIAL_FIFO_CAPACITY) {
        return false;
    }
    spi->receive.values[spi->receive.write_index] = value;
    spi->receive.metadata[spi->receive.write_index] = 0;
    spi->receive.write_index =
        (uint16_t)((spi->receive.write_index + 1u) % K22_SERIAL_FIFO_CAPACITY);
    spi->receive.count++;
    (void)k22_serial_read(&device->serial, spi->base, 4, &(uint32_t){0});
    refresh_serial_signals(device);
    return true;
}

bool kinetis_k22_spi0_transmit(KinetisK22* device, uint16_t* value) {
    if (device == NULL || value == NULL) {
        return false;
    }
    K22SerialFifo* fifo = &device->serial.spi[0].transmit;
    if (fifo->count == 0) {
        return kinetis_k22_serial_transmit(device, KINETIS_K22_SERIAL_SPI0, value);
    }
    *value = fifo->values[fifo->read_index];
    fifo->read_index = (uint16_t)((fifo->read_index + 1u) % K22_SERIAL_FIFO_CAPACITY);
    fifo->count--;
    return true;
}

bool kinetis_k22_i2c0_transfer(KinetisK22* device, KinetisK22I2cTransfer* transfer) {
    return kinetis_k22_i2c_transfer(device, KINETIS_K22_SERIAL_I2C0, transfer);
}

void kinetis_k22_i2c0_acknowledge(KinetisK22* device, bool acknowledge) {
    (void)kinetis_k22_i2c_acknowledge(device, KINETIS_K22_SERIAL_I2C0, acknowledge);
}

bool kinetis_k22_i2c0_lose_arbitration(KinetisK22* device) {
    return kinetis_k22_i2c_lose_arbitration(device, KINETIS_K22_SERIAL_I2C0);
}

bool kinetis_k22_i2c0_receive(KinetisK22* device, uint8_t value) {
    if (device == NULL || !device->serial.i2c[0].present) {
        return false;
    }
    device->serial.i2c[0].registers[4] = value;
    device->serial.i2c[0].registers[3] |= 0x82u;
    (void)k22_serial_set_clock_gate(&device->serial, K22_PERIPHERAL_I2C0, true);
    refresh_serial_signals(device);
    kinetis_k22_sync_clock_gates(device);
    return true;
}

K22DataBus kinetis_k22_data_bus(KinetisK22* device) {
    const K22DataBus bus = {device, data_bus_read, data_bus_write, flash_bus_write,
                            data_interrupt};
    return bus;
}

K22SdhcBus kinetis_k22_sdhc_bus(KinetisK22* device) {
    const K22SdhcBus bus = {device, data_bus_read, data_bus_write};
    return bus;
}

K22TimingSignals kinetis_k22_timing_signals(KinetisK22* device) {
    const K22TimingSignals signals = {device, timing_irq, timing_dma, timing_reset,
                                      timing_trigger};
    return signals;
}

K22IoConfiguration kinetis_k22_io_configuration(KinetisK22* device) {
    K22IoConfiguration configuration = k22_io_default_configuration(device->profile);
    for (uint8_t port = 0; port < K22_PACKAGE_PORT_COUNT; port++) {
        configuration.package_pin_mask[port] =
            k22_package_port_pin_mask(device->package, port);
    }
    configuration.event_handler = io_event;
    configuration.event_context = device;
    return configuration;
}
